DataProcessors/ТестированиеЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ТестированиеЗнаний</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/РежимыВикторины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РежимыВикторины</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОдинСборникБезОстановки</Name>
					<Comment>Бесконечные вопросы по одному сборнику</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СлучайныйСборник</Name>
					<Comment>Бесконечные вопросы по случайным сборникам на каждый вопрос</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Испытание</Name>
					<Comment>100 вопросов по одному сборнику</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Восхождение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Сборники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сборники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СложностиСборников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСборника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаСборника</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БратьОтветыИзТекущегоСборника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Противники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Противники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МаксимальноеЗдоровье</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СложностиПротивников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДействияЦикла</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеЦикла</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыДействийПротивников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальнаяСила</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальнаяСила</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Модификаторы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Модификаторы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Положительный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Открыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Карты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Карты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Открыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ТестированиеЗнаний/Forms/ФормаНачальныхНастроек/Ext/Form/Module.bsl
Перем Гсч;		//Генератор случайных чисел.

// Возвращает случайный доступный сборник.
&НаСервере
Функция ВернутьСлучайныйСборник()
	РезультатФункции = Справочники.Сборники.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сборники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сборники КАК Сборники
		|ГДЕ
		|	НЕ Сборники.ПометкаУдаления";
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	МассивСборников = Выгрузка.ВыгрузитьКолонку("Ссылка");
	Если МассивСборников.Количество() Тогда
		МассивСборников = ОбщегоНазначенияКлиентСервер.СмешатьМассив(МассивСборников, Гсч);
		РезультатФункции = МассивСборников[0];
	Иначе
		РезультатФункции = Справочники.Сборники.ПустаяСсылка();
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ВернутьСлучайныйСборник()

// Возвращает ссылку на текущего пользователя из параметра сеанса.
&НаСервереБезКонтекста
Функция ВернутьТекущегоПользователя()
	РезультатФункции = ПараметрыСеанса.ТекущийПользователь;
	Возврат РезультатФункции;
КонецФункции		// ВернутьТекущегоПользователя()

// Вовзращает массив выбранных сборников на форме.
&НаКлиентеНаСервереБезКонтекста
Функция СчитатьВыбранныеСборники(Форма)
	РезультатФункции = Новый Массив;
	Для Каждого ТекТаблицаСборников Из Форма.ТаблицаСборников Цикл
		Если ТекТаблицаСборников.Использование Тогда
			РезультатФункции.Добавить(ТекТаблицаСборников.Сборник);
		Иначе
			// Пользователь не выбрал сборник. Пропускаем.
		КонецЕсли;
	КонецЦикла;	
	Возврат РезультатФункции;
КонецФункции		 // СчитатьВыбранныеСборники()

// Определяет, что на форме выбран режим Случайного сборника.
&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРежимСлучайныйСборник(Форма)
	РезультатФункции = Ложь;
	ЗначениеРежимСлучайныйСборник = ПредопределенноеЗначение("Перечисление.РежимыВикторины.СлучайныйСборник");
	РезультатФункции = (Форма.РежимВикторины = ЗначениеРежимСлучайныйСборник);
	Возврат РезультатФункции;
КонецФункции		 // ЭтоРежимСлучайныйСборник()

// Определяет, что на форме выбран режим Восхождения.
&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРежимВосхождения(Форма)
	РезультатФункции = Ложь;
	ЗначениеРежимВосхождения = ПредопределенноеЗначение("Перечисление.РежимыВикторины.Восхождение");
	РезультатФункции = (Форма.РежимВикторины = ЗначениеРежимВосхождения);
	Возврат РезультатФункции;
КонецФункции		 // ЭтоРежимВосхождения()
 
// Управляет видимостью элементов на форме.
&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостью(Форма)
	// Вычисление параметров.
	РежимСлучайныйСборник	 = ЭтоРежимСлучайныйСборник(Форма);
	РежимВосхождение		 = ЭтоРежимВосхождения(Форма);
	ОтображатьВыборСборников = (РежимСлучайныйСборник);
	ОтображатьСборник = (НЕ РежимВосхождение);
	// Отображение выбора сборников.
	Форма.Элементы.Сборник.Видимость = ((НЕ ОтображатьВыборСборников) И (ОтображатьСборник));
	Форма.Элементы.ТаблицаСборников.Видимость		 = ОтображатьВыборСборников;
	Форма.Элементы.ГруппаКнопкиСборники.Видимость	 = ОтображатьВыборСборников;
	// Отображение кнопки Применить.
	Форма.Элементы.Применить.Доступность = Истина;
	Если ОтображатьВыборСборников Тогда
		МассивВыбранных = СчитатьВыбранныеСборники(Форма);	
		Если МассивВыбранных.Количество() = 0 Тогда
			Форма.Элементы.Применить.Доступность = Ложь;
		Иначе
			// Проверка пройдена.
		КонецЕсли;
	Иначе
		// Проверка пройдена.
	КонецЕсли;
	// Отображение Персонажа.
	Форма.Элементы.Персонаж.Видимость = РежимВосхождение; 
	Форма.Элементы.ГруппаПерсонаж.Видимость = РежимВосхождение; 
КонецПроцедуры		// УправлениеВидимостью()

// Заполняет таблицу сборников на форме.
&НаСервере
Процедура ЗаполнитьТаблицуСборников()
	ТаблицаСборников.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сборники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сборники КАК Сборники
		|ГДЕ
		|	НЕ Сборники.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сборники.Наименование";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ТаблицаСборников.Добавить();
		НоваяСтрока.Использование	 = Истина;
		НоваяСтрока.Сборник			 = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
КонецПроцедуры		// ЗаполнитьТаблицуСборников()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Пользователь.
	#Если МобильноеПриложениеКлиент Тогда
		
	#Иначе
		Пользователь = ВернутьТекущегоПользователя();
	#КонецЕсли
	// Режим викторины.
	РежимВикторины = Перечисления.РежимыВикторины.Восхождение;
	// Сборники.
	Если ЗначениеЗаполнено(Параметры.Сборник) Тогда
		Сборник = Параметры.Сборник;
	Иначе
		Сборник = ВернутьСлучайныйСборник();
	КонецЕсли;
	ЗаполнитьТаблицуСборников();
	// Режим Восхождение.
	Противники = ПрочитатьПротивниковИзМакета();
	ОбновитьСправочникПротивники(Противники);
	Модификаторы = ПрочитатьМодификаторыИзМакета();
	ОбновитьСправочникМодификаторы(Модификаторы);
	Карты = ПрочитатьКартыИзМакета();
	ОбновитьСправочникКарты(Карты);
	Персонаж = Справочники.Персонажи.Профессор;
	// Обновление интерфейса.
	УправлениеВидимостью(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	Если ЗначениеЗаполнено(Пользователь) Тогда
		// Считаем выбранные сборники.
		МассивВыбранных = Новый Массив;
		РежимСлучайныйСборник = ЭтоРежимСлучайныйСборник(ЭтаФорма);
		Если РежимСлучайныйСборник Тогда
			МассивВыбранных = СчитатьВыбранныеСборники(ЭтаФорма);
		Иначе
			МассивВыбранных = Новый Массив;
		КонецЕсли;
		СписокВыбранных = Новый СписокЗначений;
		СписокВыбранных.ЗагрузитьЗначения(МассивВыбранных);
		// Передадим параметры.
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Пользователь", Пользователь);
		СтруктураПараметров.Вставить("РежимВикторины", РежимВикторины);
		СтруктураПараметров.Вставить("Сборник", Сборник);
		СтруктураПараметров.Вставить("ВыбранныеСборники", СписокВыбранных);
		СтруктураПараметров.Вставить("Персонаж", Персонаж);
		// Проверка выбора сборников.
		МожноНачать = ((НЕ РежимСлучайныйСборник) ИЛИ (МассивВыбранных.Количество() > 0));
		Если НЕ МожноНачать Тогда
			ТекстСообщения = НСтр("ru = 'Для продолжения требуется выбрать хотя бы один сборник'");
			Сообщить(ТекстСообщения);
			Возврат;
		КонецЕсли;
		// Проверка выбора персонажа в режиме восхождения.
		РежимВосхождение = ЭтоРежимВосхождения(ЭтаФорма);
		Если РежимВосхождение И НЕ ЗначениеЗаполнено(Персонаж) Тогда
			ТекстСообщения = НСтр("ru = 'Для продолжения требуется выбрать персонажа'");
			Сообщить(ТекстСообщения);
			Возврат;
		КонецЕсли;
		Закрыть(СтруктураПараметров);
	Иначе
		ТекстСообщения = НСтр("ru = 'Пожалуйста, выберите пользователя'");
		Сообщить(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСправку(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РазделСправки", "НастройкиВикторины");
	ОткрытьФорму("Обработка.ОтображениеСправки.Форма.Форма", СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура РежимВикториныПриИзменении(Элемент)
	УправлениеВидимостью(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСборниковИспользованиеПриИзменении(Элемент)
	УправлениеВидимостью(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого ТекТаблицаСборников Из ТаблицаСборников Цикл
		ТекТаблицаСборников.Использование = Ложь;
	КонецЦикла;	
	УправлениеВидимостью(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для Каждого ТекТаблицаСборников Из ТаблицаСборников Цикл
		ТекТаблицаСборников.Использование = Истина;
	КонецЦикла;	
	УправлениеВидимостью(ЭтаФорма);
КонецПроцедуры

// Возвращает массив структур с данными противников из общего макета Противники_Предопределенный.
&НаСервере
Функция ПрочитатьПротивниковИзМакета()
	РезультатФункции = Новый Массив;
	Макет = ПолучитьОбщийМакет("Противники_Предопределенный");
	СодержимоеЯчейки = Макет.Область("R1C1").Текст;
	Если ПустаяСтрока(СодержимоеЯчейки) Тогда
		Возврат РезультатФункции;
	Иначе
		ЧтениеXML = Новый ЧтениеXML;
		ПозицияДекларации = СтрНайти(СодержимоеЯчейки, "?>");
		Если ПозицияДекларации > 0 Тогда
			СтрокаБезДекларации = Сред(СодержимоеЯчейки, ПозицияДекларации + 2);
		Иначе
			СтрокаБезДекларации = СодержимоеЯчейки;
		КонецЕсли;
		СтрокаXML = "<root>" + СтрокаБезДекларации + "</root>";
		ЧтениеXML.УстановитьСтроку(СтрокаXML);
		ПостроительDOM = Новый ПостроительDOM;
		ДокументXML = ПостроительDOM.Прочитать(ЧтениеXML);
		ЭлементRoot = ДокументXML.ЭлементДокумента;
		Для Каждого ЭлементChild Из ЭлементRoot.ДочерниеУзлы Цикл
			Если ЭлементChild.ИмяУзла = "Enemies" Тогда
				Для Каждого ЭлементEnemy Из ЭлементChild.ДочерниеУзлы Цикл
					Если ЭлементEnemy.ИмяУзла = "Enemy" Тогда
						НовыйПротивник = Новый Структура;
						Если ЭлементEnemy.Атрибуты.Количество() > 0 Тогда
							Для Каждого Атрибут Из ЭлементEnemy.Атрибуты Цикл
								Если Атрибут.Имя = "id" Тогда
									НовыйПротивник.Вставить("Id", Атрибут.Значение);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						Для Каждого ДочернийУзел Из ЭлементEnemy.ДочерниеУзлы Цикл
							Если ДочернийУзел.ИмяУзла = "Name" Тогда
								НовыйПротивник.Вставить("Name", ДочернийУзел.ТекстовоеСодержимое);
							ИначеЕсли ДочернийУзел.ИмяУзла = "Description" Тогда
								НовыйПротивник.Вставить("Description", ДочернийУзел.ТекстовоеСодержимое);
							ИначеЕсли ДочернийУзел.ИмяУзла = "MaxHealth" Тогда
								НовыйПротивник.Вставить("MaxHealth", Число(ДочернийУзел.ТекстовоеСодержимое));
							ИначеЕсли ДочернийУзел.ИмяУзла = "Difficulty" Тогда
								НовыйПротивник.Вставить("Difficulty", ДочернийУзел.ТекстовоеСодержимое);
							ИначеЕсли ДочернийУзел.ИмяУзла = "ActionCycle" Тогда
								МассивДействий = Новый Массив;
								Для Каждого ЭлементAction Из ДочернийУзел.ДочерниеУзлы Цикл
									Если ЭлементAction.ИмяУзла = "Action" Тогда
										СтруктураДействия = Новый Структура;
										Для Каждого ЭлементДействия Из ЭлементAction.ДочерниеУзлы Цикл
											Если ЭлементДействия.ИмяУзла = "Type" Тогда
												СтруктураДействия.Вставить("Type", ЭлементДействия.ТекстовоеСодержимое);
											ИначеЕсли ЭлементДействия.ИмяУзла = "MinPower" Тогда
												СтруктураДействия.Вставить("MinPower", Число(ЭлементДействия.ТекстовоеСодержимое));
											ИначеЕсли ЭлементДействия.ИмяУзла = "MaxPower" Тогда
												СтруктураДействия.Вставить("MaxPower", Число(ЭлементДействия.ТекстовоеСодержимое));
											КонецЕсли;
										КонецЦикла;
										МассивДействий.Добавить(СтруктураДействия);
									КонецЕсли;
								КонецЦикла;
								НовыйПротивник.Вставить("ActionCycle", МассивДействий);
							КонецЕсли;
						КонецЦикла;
						РезультатФункции.Добавить(НовыйПротивник);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		ЧтениеXML.Закрыть();
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции

// Возвращает версию противников из общего макета Противники_Предопределенный.
//
// Возвращаемое значение:
//   Число - версия противников из макета. 0 если версия не найдена.
//
&НаСервере
Функция ПолучитьВерсиюПротивниковИзМакета()
	РезультатФункции = 0;
	Макет = ПолучитьОбщийМакет("Противники_Предопределенный");
	СодержимоеЯчейки = Макет.Область("R1C1").Текст;
	ПозицияНачала = СтрНайти(СодержимоеЯчейки, "<version>");
	ПозицияКонца = СтрНайти(СодержимоеЯчейки, "</version>");
	Если ПозицияНачала = 0 Или ПозицияКонца = 0 Тогда
		Возврат РезультатФункции;
	Иначе
		ПозицияНачала = ПозицияНачала + 9; // Длина "<version>"
		СтрокаВерсии = Сред(СодержимоеЯчейки, ПозицияНачала, ПозицияКонца - ПозицияНачала);
		РезультатФункции = Число(СтрокаВерсии);
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции // ПолучитьВерсиюПротивниковИзМакета()

// Обновляет справочник Противники по данным из массива структур, если версия в макете отличается от константы.
//
// Параметры:
//   МассивПротивников - Массив - массив структур с данными противников.
//
&НаСервере
Процедура ОбновитьСправочникПротивники(МассивПротивников)
	// Проверка версии.
	ВерсияИзМакета = ПолучитьВерсиюПротивниковИзМакета();
	ВерсияВКонстанте = Константы.ВерсияПротивников.Получить();
	Если ВерсияИзМакета = ВерсияВКонстанте Тогда
		Возврат;
	Иначе
		// Версии отличаются. Продолжаем обновление.
	КонецЕсли;
	Для Каждого ДанныеПротивника Из МассивПротивников Цикл
		Попытка
			НайденныйЭлемент = Справочники.Противники.НайтиПоРеквизиту("ВнешнийID", ДанныеПротивника.Id);
			Если НЕ ЗначениеЗаполнено(НайденныйЭлемент) Тогда
				НовыйЭлемент = Справочники.Противники.СоздатьЭлемент();
				НовыйЭлемент.ВнешнийID	 = ДанныеПротивника.Id;
			Иначе
				НовыйЭлемент			 = НайденныйЭлемент.ПолучитьОбъект();
			КонецЕсли;
			НовыйЭлемент.Наименование = ДанныеПротивника.Name;
			НовыйЭлемент.Описание = ДанныеПротивника.Description;
			НовыйЭлемент.МаксимальноеЗдоровье = ДанныеПротивника.MaxHealth;
			Если ДанныеПротивника.Свойство("Difficulty") Тогда
				НовыйЭлемент.Сложность = Перечисления.СложностиПротивников[ДанныеПротивника.Difficulty];
			КонецЕсли;
			НовыйЭлемент.ДействияЦикла.Очистить();
			Для Каждого ДанныеДействия Из ДанныеПротивника.ActionCycle Цикл
				НовоеДействие = Перечисления.ВариантыДействийПротивников[ДанныеДействия.Type];
				НоваяСтрокаДействия = НовыйЭлемент.ДействияЦикла.Добавить();
				НоваяСтрокаДействия.ДействиеЦикла		 = НовоеДействие;
				НоваяСтрокаДействия.МинимальнаяСила		 = ДанныеДействия.MinPower;
				НоваяСтрокаДействия.МаксимальнаяСила	 = ДанныеДействия.MaxPower;
			КонецЦикла;
			НовыйЭлемент.Записать();
		Исключение
			ОписаниеОповещения = "Ошибка при обновлении противника с Id " + ДанныеПротивника.Id + ": " + ОписаниеОшибки();
			Сообщить(ОписаниеОповещения);
		КонецПопытки;
	КонецЦикла;
	// Запись новой версии в константу.
	МенеджерКонстанты = Константы.ВерсияПротивников.СоздатьМенеджерЗначения();
	МенеджерКонстанты.Значение = ВерсияИзМакета;
	МенеджерКонстанты.Записать();
КонецПроцедуры // ОбновитьСправочникПротивники()

// Возвращает массив структур с данными модификаторов из общего макета Модификаторы_Предопределенный.
&НаСервере
Функция ПрочитатьМодификаторыИзМакета()
	РезультатФункции = Новый Массив;
	Макет = ПолучитьОбщийМакет("Модификаторы_Предопределенный");
	СодержимоеЯчейки = Макет.Область("R1C1").Текст;
	Если ПустаяСтрока(СодержимоеЯчейки) Тогда
		Возврат РезультатФункции;
	Иначе
		ЧтениеXML = Новый ЧтениеXML;
		ПозицияДекларации = СтрНайти(СодержимоеЯчейки, "?>");
		Если ПозицияДекларации > 0 Тогда
			СтрокаБезДекларации = Сред(СодержимоеЯчейки, ПозицияДекларации + 2);
		Иначе
			СтрокаБезДекларации = СодержимоеЯчейки;
		КонецЕсли;
		СтрокаXML = "<root>" + СтрокаБезДекларации + "</root>";
		ЧтениеXML.УстановитьСтроку(СтрокаXML);
		ПостроительDOM = Новый ПостроительDOM;
		ДокументXML = ПостроительDOM.Прочитать(ЧтениеXML);
		ЭлементRoot = ДокументXML.ЭлементДокумента;
		Для Каждого ЭлементChild Из ЭлементRoot.ДочерниеУзлы Цикл
			Если ЭлементChild.ИмяУзла = "modifiers" Тогда
				Для Каждого ЭлементModifier Из ЭлементChild.ДочерниеУзлы Цикл
					Если ЭлементModifier.ИмяУзла = "modifier" Тогда
						НовыйМодификатор = Новый Структура;
						Для Каждого ДочернийУзел Из ЭлементModifier.ДочерниеУзлы Цикл
							Если ДочернийУзел.ИмяУзла = "name" Тогда
								НовыйМодификатор.Вставить("Name", ДочернийУзел.ТекстовоеСодержимое);
							ИначеЕсли ДочернийУзел.ИмяУзла = "title" Тогда
								НовыйМодификатор.Вставить("Title", ДочернийУзел.ТекстовоеСодержимое);
							ИначеЕсли ДочернийУзел.ИмяУзла = "description" Тогда
								НовыйМодификатор.Вставить("Description", ДочернийУзел.ТекстовоеСодержимое);
							ИначеЕсли ДочернийУзел.ИмяУзла = "positive" Тогда
								НовыйМодификатор.Вставить("Positive", ДочернийУзел.ТекстовоеСодержимое = "true");
							ИначеЕсли ДочернийУзел.ИмяУзла = "defaultDuration" Тогда
								Если Не ПустаяСтрока(ДочернийУзел.ТекстовоеСодержимое) Тогда
									НовыйМодификатор.Вставить("DefaultDuration", Число(ДочернийУзел.ТекстовоеСодержимое));
								Иначе
									НовыйМодификатор.Вставить("DefaultDuration", 0);
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
						РезультатФункции.Добавить(НовыйМодификатор);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		ЧтениеXML.Закрыть();
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции

// Возвращает версию модификаторов из общего макета Модификаторы_Предопределенный.
//
// Возвращаемое значение:
//   Число - версия модификаторов из макета. 0 если версия не найдена.
//
&НаСервере
Функция ПолучитьВерсиюМодификаторовИзМакета()
	РезультатФункции = 0;
	Макет = ПолучитьОбщийМакет("Модификаторы_Предопределенный");
	СодержимоеЯчейки = Макет.Область("R1C1").Текст;
	ПозицияНачала = СтрНайти(СодержимоеЯчейки, "<version>");
	ПозицияКонца = СтрНайти(СодержимоеЯчейки, "</version>");
	Если ПозицияНачала = 0 Или ПозицияКонца = 0 Тогда
		Возврат РезультатФункции;
	Иначе
		ПозицияНачала = ПозицияНачала + 9; // Длина "<version>"
		СтрокаВерсии = Сред(СодержимоеЯчейки, ПозицияНачала, ПозицияКонца - ПозицияНачала);
		РезультатФункции = Число(СтрокаВерсии);
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции // ПолучитьВерсиюМодификаторовИзМакета()

// Обновляет справочник Модификаторы по данным из массива структур, если версия в макете отличается от константы.
//
// Параметры:
//   МассивМодификаторовВход - Массив - массив структур с данными модификаторов.
//
&НаСервере
Процедура ОбновитьСправочникМодификаторы(МассивМодификаторовВход)
	// Проверка версии.
	ВерсияИзМакета = ПолучитьВерсиюМодификаторовИзМакета();
	ВерсияВКонстанте = Константы.ВерсияМодификаторов.Получить();
	Если ВерсияИзМакета = ВерсияВКонстанте Тогда
		Возврат;
	Иначе
		// Версии отличаются. Продолжаем обновление.
	КонецЕсли;
	Попытка
		// Создаем соответствие для поиска по ключам (ИмяПредопределенныхДанных)
		СоответствиеМодификаторов = Новый Соответствие;
		// Формируем массив ключей для выборки
		МассивКлючей = Новый Массив;
		Для Каждого ДанныеМодификатора Из МассивМодификаторовВход Цикл
			МассивКлючей.Добавить(ДанныеМодификатора.Name);
		КонецЦикла;
		// Выполняем один запрос для получения всех элементов справочника
		Если МассивКлючей.Количество() > 0 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|Модификаторы.Ссылка КАК Ссылка,
				|Модификаторы.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
				|ИЗ
				|Справочник.Модификаторы КАК Модификаторы
				|ГДЕ
				|Модификаторы.ИмяПредопределенныхДанных В(&МассивКлючей)
				|И НЕ Модификаторы.ПометкаУдаления";
			Запрос.УстановитьПараметр("МассивКлючей", МассивКлючей);
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СоответствиеМодификаторов.Вставить(ВыборкаДетальныеЗаписи.ИмяПредопределенныхДанных, ВыборкаДетальныеЗаписи.Ссылка);
			КонецЦикла;
			// Проходим по массиву модификаторов и обновляем найденные элементы
			Для Каждого ДанныеМодификатора Из МассивМодификаторовВход Цикл
				ИмяКлюча = ДанныеМодификатора.Name;
				НайденныйЭлемент = СоответствиеМодификаторов.Получить(ИмяКлюча);
				Если НайденныйЭлемент <> Неопределено Тогда
					НовыйЭлемент = НайденныйЭлемент.ПолучитьОбъект();
					НовыйЭлемент.Наименование				 = ДанныеМодификатора.Title;
					НовыйЭлемент.Описание					 = ДанныеМодификатора.Description;
					НовыйЭлемент.Положительный				 = ДанныеМодификатора.Positive;
					НовыйЭлемент.ДлительностьПоУмолчанию	 = ДанныеМодификатора.DefaultDuration;
					Попытка
						Если Число(НовыйЭлемент.Код) < 8 Тогда
							НовыйЭлемент.Открыт = Истина;
						КонецЕсли;
					Исключение
						// Код не может быть преобразован к числу — пропускаем.
					КонецПопытки;
					НовыйЭлемент.Записать();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// Запись новой версии в константу.
		МенеджерКонстанты = Константы.ВерсияМодификаторов.СоздатьМенеджерЗначения();
		МенеджерКонстанты.Значение = ВерсияИзМакета;
		МенеджерКонстанты.Записать();
	Исключение
		ТекстСообщения = "Ошибка при обновлении модификаторов: " + ОписаниеОшибки();
		Сообщить(ТекстСообщения);
	КонецПопытки;
КонецПроцедуры // ОбновитьСправочникМодификаторы()

// Возвращает массив структур с данными карт из общего макета Карты_Предопределенный.
&НаСервере
Функция ПрочитатьКартыИзМакета()
	РезультатФункции = Новый Массив;
	Макет = ПолучитьОбщийМакет("Карты_Предопределенный");
	СодержимоеЯчейки = Макет.Область("R1C1").Текст;
	Если ПустаяСтрока(СодержимоеЯчейки) Тогда
		Возврат РезультатФункции;
	Иначе
		ЧтениеXML = Новый ЧтениеXML;
		ПозицияДекларации = СтрНайти(СодержимоеЯчейки, "?>");
		Если ПозицияДекларации > 0 Тогда
			СтрокаБезДекларации = Сред(СодержимоеЯчейки, ПозицияДекларации + 2);
		Иначе
			СтрокаБезДекларации = СодержимоеЯчейки;
		КонецЕсли;
		СтрокаXML = "<root>" + СтрокаБезДекларации + "</root>";
		ЧтениеXML.УстановитьСтроку(СтрокаXML);
		ПостроительDOM = Новый ПостроительDOM;
		ДокументXML = ПостроительDOM.Прочитать(ЧтениеXML);
		ЭлементRoot = ДокументXML.ЭлементДокумента;
		Для Каждого ЭлементChild Из ЭлементRoot.ДочерниеУзлы Цикл
			Если ЭлементChild.ИмяУзла = "cards" Тогда
				Для Каждого ЭлементCard Из ЭлементChild.ДочерниеУзлы Цикл
					Если ЭлементCard.ИмяУзла = "card" Тогда
						НоваяКарта = Новый Структура;
						Для Каждого ДочернийУзел Из ЭлементCard.ДочерниеУзлы Цикл
							Если ДочернийУзел.ИмяУзла = "name" Тогда
								НоваяКарта.Вставить("Name", ДочернийУзел.ТекстовоеСодержимое);
							ИначеЕсли ДочернийУзел.ИмяУзла = "title" Тогда
								НоваяКарта.Вставить("Title", ДочернийУзел.ТекстовоеСодержимое);
							ИначеЕсли ДочернийУзел.ИмяУзла = "description" Тогда
								НоваяКарта.Вставить("Description", ДочернийУзел.ТекстовоеСодержимое);
							ИначеЕсли ДочернийУзел.ИмяУзла = "cost" Тогда
								Если Не ПустаяСтрока(ДочернийУзел.ТекстовоеСодержимое) Тогда
									НоваяКарта.Вставить("Cost", Число(ДочернийУзел.ТекстовоеСодержимое));
								Иначе
									НоваяКарта.Вставить("Cost", 0);
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
						РезультатФункции.Добавить(НоваяКарта);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		ЧтениеXML.Закрыть();
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции

// Возвращает версию карт из общего макета Карты_Предопределенный.
//
// Возвращаемое значение:
//   Число - версия карт из макета. 0 если версия не найдена.
//
&НаСервере
Функция ПолучитьВерсиюКартИзМакета()
	РезультатФункции = 0;
	Макет = ПолучитьОбщийМакет("Карты_Предопределенный");
	СодержимоеЯчейки = Макет.Область("R1C1").Текст;
	ПозицияНачала = СтрНайти(СодержимоеЯчейки, "<version>");
	ПозицияКонца = СтрНайти(СодержимоеЯчейки, "</version>");
	Если ПозицияНачала = 0 Или ПозицияКонца = 0 Тогда
		Возврат РезультатФункции;
	Иначе
		ПозицияНачала = ПозицияНачала + 9; // Длина "<version>"
		СтрокаВерсии = Сред(СодержимоеЯчейки, ПозицияНачала, ПозицияКонца - ПозицияНачала);
		РезультатФункции = Число(СтрокаВерсии);
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции // ПолучитьВерсиюКартИзМакета()

// Обновляет справочник Карты по данным из массива структур, если версия в макете отличается от константы.
//
// Параметры:
//   МассивКарт - Массив - массив структур с данными карт.
//
&НаСервере
Процедура ОбновитьСправочникКарты(МассивКарт)
	// Проверка версии.
	ВерсияИзМакета = ПолучитьВерсиюКартИзМакета();
	ВерсияВКонстанте = Константы.ВерсияКарт.Получить();
	Если ВерсияИзМакета = ВерсияВКонстанте Тогда
		Возврат;
	Иначе
		// Версии отличаются. Продолжаем обновление.
	КонецЕсли;
	Попытка
		// Создаем соответствие для поиска по ключам (ИмяПредопределенныхДанных)
		СоответствиеКарт = Новый Соответствие;
		// Формируем массив ключей для выборки
		МассивКлючей = Новый Массив;
		Для Каждого ДанныеКарты Из МассивКарт Цикл
			МассивКлючей.Добавить(ДанныеКарты.Name);
		КонецЦикла;
		// Выполняем один запрос для получения всех элементов справочника
		Если МассивКлючей.Количество() > 0 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|Карты.Ссылка КАК Ссылка,
				|Карты.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
				|ИЗ
				|Справочник.Карты КАК Карты
				|ГДЕ
				|Карты.ИмяПредопределенныхДанных В(&МассивКлючей)
				|И НЕ Карты.ПометкаУдаления";
			Запрос.УстановитьПараметр("МассивКлючей", МассивКлючей);
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СоответствиеКарт.Вставить(ВыборкаДетальныеЗаписи.ИмяПредопределенныхДанных, ВыборкаДетальныеЗаписи.Ссылка);
			КонецЦикла;
			// Проходим по массиву карт и обновляем найденные элементы
			Для Каждого ДанныеКарты Из МассивКарт Цикл
				Идентификатор = ДанныеКарты.Name;
				НайденныйЭлемент = СоответствиеКарт.Получить(Идентификатор);
				Если НайденныйЭлемент <> Неопределено Тогда
					НовыйЭлемент = НайденныйЭлемент.ПолучитьОбъект();
					НовыйЭлемент.Наименование	 = ДанныеКарты.Title;
					НовыйЭлемент.Описание		 = ДанныеКарты.Description;
					НовыйЭлемент.Стоимость		 = ДанныеКарты.Cost;
					Попытка
						Если Число(НовыйЭлемент.Код) < 16 Тогда
							НовыйЭлемент.Открыта = Истина;
						КонецЕсли;
					Исключение
						// Код не может быть преобразован к числу — пропускаем.
					КонецПопытки;
					НовыйЭлемент.Записать();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// Запись новой версии в константу.
		МенеджерКонстанты = Константы.ВерсияКарт.СоздатьМенеджерЗначения();
		МенеджерКонстанты.Значение = ВерсияИзМакета;
		МенеджерКонстанты.Записать();
	Исключение
		ТекстСообщения = "Ошибка при обновлении карт: " + ОписаниеОшибки();
		Сообщить(ТекстСообщения);
	КонецПопытки;
КонецПроцедуры // ОбновитьСправочникКарты()

// Переключает реквизит Персонаж на предыдущее предопределённое значение справочника Персонажи.
&НаКлиенте
Процедура ПредыдущийПерсонаж(Команда)
	Персонаж = ПолучитьПредыдущегоПерсонажа(Персонаж);
	ОбновитьКартинкуПерсонажа();
КонецПроцедуры

// Обновляет декорацию картинки персонажа по соответствию предопределённого элемента и названия картинки.
&НаКлиенте
Процедура ОбновитьКартинкуПерсонажа()
	СоответствиеКартинок = ПолучитьСоответствиеКартинокПерсонажей();
	ИмяКартинки = СоответствиеКартинок.Получить(Персонаж);
	Если ИмяКартинки <> Неопределено Тогда
		Элементы.ДекорацияКартинкаПерсонаж.Картинка = БиблиотекаКартинок[ИмяКартинки];
	Иначе
		// Для персонажа не задана картинка. Оставляем текущую картинку.
	КонецЕсли;
КонецПроцедуры // ОбновитьКартинкуПерсонажа()

// Возвращает соответствие предопределённых элементов справочника Персонажи и названий общих картинок.
//
// Возвращаемое значение:
//   Соответствие - ключ: СправочникСсылка.Персонажи, значение: Строка - имя общей картинки.
//
&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСоответствиеКартинокПерсонажей()
	РезультатФункции = Новый Соответствие;
	РезультатФункции.Вставить(ПредопределенноеЗначение("Справочник.Персонажи.Профессор"), "Персонаж_Профессор");
	РезультатФункции.Вставить(ПредопределенноеЗначение("Справочник.Персонажи.Дуэлянт"), "Персонаж_Дуэлянт");
	РезультатФункции.Вставить(ПредопределенноеЗначение("Справочник.Персонажи.Архивариус"), "Персонаж_Архивариус");
	РезультатФункции.Вставить(ПредопределенноеЗначение("Справочник.Персонажи.Алхимик"), "Персонаж_Алхимик");
	РезультатФункции.Вставить(ПредопределенноеЗначение("Справочник.Персонажи.Софист"), "Персонаж_Софист");
	РезультатФункции.Вставить(ПредопределенноеЗначение("Справочник.Персонажи.Еретик"), "Персонаж_Еретик");
	РезультатФункции.Вставить(ПредопределенноеЗначение("Справочник.Персонажи.Оратор"), "Персонаж_Оратор");
	Возврат РезультатФункции;
КонецФункции // ПолучитьСоответствиеКартинокПерсонажей()

// Возвращает массив предопределённых элементов справочника Персонажи, упорядоченный по коду.
//
// Возвращаемое значение:
//   Массив - массив ссылок СправочникСсылка.Персонажи в порядке возрастания кода.
//
&НаСервереБезКонтекста
Функция ПолучитьСписокПерсонажей()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Персонажи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Персонажи КАК Персонажи
		|ГДЕ
		|	Персонажи.Предопределенный
		|
		|УПОРЯДОЧИТЬ ПО
		|	Персонажи.Код";
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	РезультатФункции = Выгрузка.ВыгрузитьКолонку("Ссылка");
	Возврат РезультатФункции;
КонецФункции // ПолучитьСписокПерсонажей()

// Возвращает предыдущее предопределённое значение справочника Персонажи по кругу.
//
// Параметры:
//   ПерсонажВход - СправочникСсылка.Персонажи - текущий персонаж.
//
// Возвращаемое значение:
//   СправочникСсылка.Персонажи - предыдущий персонаж. Если ПерсонажВход первый в списке,
//   возвращается последний персонаж справочника.
//
&НаСервереБезКонтекста
Функция ПолучитьПредыдущегоПерсонажа(Знач ПерсонажВход)
	РезультатФункции = ПерсонажВход;
	МассивПерсонажей = ПолучитьСписокПерсонажей();
	ИндексТекущего = МассивПерсонажей.Найти(ПерсонажВход);
	Если ИндексТекущего = 0 Тогда
		РезультатФункции = МассивПерсонажей[МассивПерсонажей.Количество() - 1];
	ИначеЕсли ИндексТекущего > 0 Тогда
		РезультатФункции = МассивПерсонажей[ИндексТекущего - 1];
	Иначе
		// Текущий персонаж не найден среди предопределённых. Оставляем значение без изменений.
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции // ПолучитьПредыдущегоПерсонажа()

// Возвращает следующее предопределённое значение справочника Персонажи по кругу.
//
// Параметры:
//   ПерсонажВход - СправочникСсылка.Персонажи - текущий персонаж.
//
// Возвращаемое значение:
//   СправочникСсылка.Персонажи - следующий персонаж. Если ПерсонажВход последний в списке,
//   возвращается первый персонаж справочника.
//
&НаСервереБезКонтекста
Функция ПолучитьСледующегоПерсонажа(Знач ПерсонажВход)
	РезультатФункции = ПерсонажВход;
	МассивПерсонажей = ПолучитьСписокПерсонажей();
	ИндексТекущего = МассивПерсонажей.Найти(ПерсонажВход);
	Если ИндексТекущего = МассивПерсонажей.Количество() - 1 Тогда
		РезультатФункции = МассивПерсонажей[0];
	ИначеЕсли ИндексТекущего >= 0 Тогда
		РезультатФункции = МассивПерсонажей[ИндексТекущего + 1];
	Иначе
		// Текущий персонаж не найден среди предопределённых. Оставляем значение без изменений.
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции // ПолучитьСледующегоПерсонажа()

// Переключает реквизит Персонаж на следующее предопределённое значение справочника Персонажи.
&НаКлиенте
Процедура СледующийПерсонаж(Команда)
	Персонаж = ПолучитьСледующегоПерсонажа(Персонаж);
	ОбновитьКартинкуПерсонажа();
КонецПроцедуры

Гсч = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
